packages/artillery/test/scripts/scenario-payload-with-envs/scenario.yml
#https://github.com/artilleryio/artillery/issues/1961
config:
  environments:
    staging:
      payload:
        - fields:
            - "id"
            - "name"
          skipHeader: true
          path: "./data/my-data.csv"
          order: sequence
  target: https://http.cat
  phases:
    - duration: 1
      arrivalRate: 1
      maxVusers: 1
      name: "low level"
scenarios:
  - name: Test Scenario
    flow:
      - log: "Successfully ran with id: {{ id }}"